Revit 2024 API
ExternalServices.BuiltInExternalServices.PipeFittingAndAccessoryPressureDropUIService Property
 The external service which permits registration of an alternate implementation for a pipe fitting and accessory pressure drop calculation UI. To use this service, programmers implement a server class that derives from IPipeFittingAndAccessoryPressureDropUIServer.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ExternalServiceId PipeFittingAndAccessoryPressureDropUIService { get; }
Visual Basic
Public Shared ReadOnly Property PipeFittingAndAccessoryPressureDropUIService As ExternalServiceId
	Get
Visual C++
public:
static property ExternalServiceId^ PipeFittingAndAccessoryPressureDropUIService {
	ExternalServiceId^ get ();
}
See Also
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace